CMFCToolBar.m_bDontScaleImages
Specifies whether to scale or not toolbar images in high DPI mode.

CMFCToolBar.SetLockedSizes(tagSIZE,tagSIZE,System.Int32)
Sets the sizes of locked buttons and locked images on the toolbar.
sizeButton: Specifies the size of locked toolbar buttons.
sizeImage: Specifies the size of locked toolbar images.
bDontScale: Specifies whether to scale or not locked toolbar images in high DPI mode.